OpenFOAM/sampleB/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2112                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            flowRatePoiseuilleVelocity;
        volumetricFlowRate constant 8.5e-07;
	circularCrossSection true;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            matchedFlowRateOutletVelocity;
        inletPatch      inlet;
        value           uniform (0 0 0);
    }
    wall
    {
        type            noSlip;
    }
}


// ************************************************************************* //
